[
  {
    "title": "Senior Full Stack Developer",
    "company": "Terra Instinct",
    "location": "Beirut, Beirut Governorate, Lebanon",
    "postingDate": "1 day ago",
    "applicants": "52 applicants",
    "description": "About the job  About Terra Instinct  We are a fast-growing sustainability consultancy with a client list of financial institutions across Europe, with ambitions to expand beyond this. We do cutting-edge work with our clients to put them on the front foot in the fight against climate change and its impacts. We help our clients measure their impact, develop mitigation strategies and assess climate risk. We focus on how clients can protect and enhance value through sustainability. They rightly have high expectations of our work, and we, in turn, have high expectations of our people. Ours is a high-performance culture; we work hard, learn fast and develop faster. Our team collaborates very closely, developing trusting relationships that help us excel. Joining our firm will be demanding but enjoyable, and you'll learn more here than anywhere else.     Role description - Senior Full Stack Developer (6+ years experience)   You will be the lead developer for a sustainability platform that collects inputs from users and other data sources via API and incorporates them into pre-defined prompts, submitted via API to an AI engine. The responses will be collated into a user dashboard with export functionality. You will be working with subject matter experts, leaders in their field, to build a platform which will bring transparency in sustainability to thousands of companies. The prompts are already developed by our expert consultants and your role will be deliver an MVP of the web application.      This is a full-time role, based in Beirut. You will be the first developer hired which puts you in prime position to benefit from the company's success with this product.     Who we are looking for:   You will be an intellectually curious person with a keen desire to work on the practical application of large language models. You will already have some experience building tools that integrate with LLMs, either as formal commercial projects or small personal ones. You should be able to demonstrate this experience clearly and talk through the logical approach to working with LLMs. You will be able to clearly articulate a development approach and how your experience will help you achieve this, including your approach to quality assurance and user acceptance testing.      Education  A bachelor’s degree in computer science, or Science/ Engineering/ Technology/ Mathematics subjects are preferred. Advanced degrees (Masters or PhD) related to LLMs would be a plus.     Professional Experience:  5+ years experience as a full stack developer (Demonstrable experience is more important that education)     Experience with LLMs:  Demonstrable experience working with large language models, including but not limited to Claude, GPT, BERT, or similar. Experience should include developing applications, tools, or systems that utilize these models for varying tasks.     Programming Skills:  Proficiency in programming languages commonly used in AI and machine learning - Python is the minimum requirement, and familiarity with AI frameworks and libraries (e.g., TensorFlow, PyTorch,). Familiarity with AWS and Amazon Bedrock a bonus.     Project Portfolio:  A portfolio of projects (commercial or personal) that showcases the application of LLMs. The candidate should be able to explain their role, the project's approach, and the outcomes.     Problem-Solving Skills:  Evidence of strong analytical and problem-solving skills, particularly in the context of applying LLMs to practical problems. This could be demonstrated through descriptions of how challenges were addressed in past projects.     Competencies:   Logical Approach: The ability to logically approach the development and integration of LLMs, including planning, execution, and troubleshooting. Communication Skills: Excellent verbal and written communication skills, necessary for articulating development approaches, collaborating with team members, and documenting projects. Quality Assurance and User Acceptance Testing: Knowledge and experience in setting up rigorous testing environments, including automated testing, to ensure the reliability and accuracy of applications built on LLMs. Collaborative Experience: Experience working in agile development teams and familiarity with tools and practices for collaboration and version control (e.g., Git, Jira, AzureDevops etc)."
  },
  {
    "title": "Senior Dotnet Developer",
    "company": "ONSITE - Construction Management Experts",
    "location": "Jounieh, Keserwan-Jbeil Governorate, Lebanon",
    "postingDate": "1 month ago",
    "applicants": "Over 100 applicants",
    "description": "About the job  Qualifications  Bachelor's degree in Computer Science or relevant field 4+ years of experience developing web-based applications using C# / ASP.NET Core. Solid experience with UI development using jQuery, JavaScript, CSS, Bootstrap and HTML5. Experience working with MS SQL Server and MySQL Knowledge of practices and procedures for full software design life cycle Experience working in agile development environment     The ideal candidate will be familiar with the full software design life cycle. They should have experience in designing, coding, testing and consistently managing applications They should be comfortable coding in a number of languages and have an ability to test code in order to maintain high-quality code.      Job Details  Job Location: Jounieh, Lebanon Company Industry: Construction Software, SaaS Technology Employment Type: Full Time Employee Monthly Salary Range: $1,500 - $4,000 Number of Vacancies: 3 Hiring timeline: immediate"
  },
  {
    "title": "Full Stack Web Developer (Remote)",
    "company": "Casa Bella Media",
    "location": "Lebanon",
    "postingDate": "2 days ago",
    "applicants": "Over 100 applicants",
    "description": "About the job  Full Stack Web Developer     The ideal candidate will have strong creativity and a portfolio of work which demonstrates their passion for web developing and web designing. This candidate will have experiences in working with both english and arabic     Responsibilities  Know HTML, CSS, JavaScript, PHP and other relevant web design coding languages. Front end and back end Develop websites for the company Strong knowledge on Wordpress Work with graphics designers Troubleshoot website problems Maintain and update website on a regular basis Monitor website traffic Stay up to date on technology Basic SEO knowledge could be an added advantage     Qualifications  Bachelor’s Degree in Information Technology, Computer Science, or Computer Application Minimum 3 years of experience Require a good knowledge in Web Developing & Design     If you are qualified, it’s about time to join our team now!  Email your CV to career@spaceandplace.ae"
  },
  {
    "title": "Mobile App Developer",
    "company": "BLOM BANK s.a.l.",
    "location": "Beirut Governorate, Lebanon",
    "postingDate": "1 day ago",
    "applicants": "59 applicants",
    "description": "About the job  Join our team and be part of the world of financial technology innovation!     We are seeking skilled and motivated individuals with minimum 3 years of experience for the position of Mobile App Developer. This is your opportunity to secure an evolutive career path with a SMART salary scheme, tailored to your relevant experience and aligned with the wider international market.     Required Skills:     Proficiency in Java/Kotlin and/or Swift programming for mobile applications A solid understanding of mobile development principles and best practices  A good grasp of the entire mobile development life cycle Experience in creating and deploying mobile applications for iOS and/or Android platforms Knowledge of best practices for ensuring mobile application security     Additional preferred skills:     Experience in Javascript  Familiarity with cross-platform development frameworks Experience with web development libraries A proven track record of implementing and integrating complex features for specific platforms Familiarity with mobile application analytics, crash reporting tools, and performance monitoring solutions"
  },
  {
    "title": "Junior Full Stack Developer",
    "company": "Apliman",
    "location": "Beirut Governorate, Lebanon",
    "postingDate": "Reposted 3 weeks ago",
    "applicants": "Over 100 applicants",
    "description": "About the job  We are looking for a dynamic, talented, and proactive Junior Full Stack Developer who will be responsible for developing and maintaining our services, designing and developing scalable and secure codes using different developmental techniques. Your role as a Junior Full Stack Developer will include being a passionate tech-savvy developer and collaborating with cross-functional teams in gathering requirements to enhance existing products and codes and to implement new features on our existing products.     Reponsibilities and Duties:   Design, develop, and deploy scalable and secure services using Java, SQL, and API development techniques. Collaborate with cross-functional teams, including designers and product managers, to gather requirements and implement new features. Write clean, efficient, and maintainable code using best practices and coding standards. Perform unit testing and debugging of applications to ensure high-quality deliverables. Optimize application performance and enhance user experience through continuous improvements. Integrate front-end and back-end components by leveraging frameworks such as Spring Boot and Spring Data. Develop responsive and user-friendly front-end interfaces using Angular or Flutter (knowledge of these frameworks is a plus). Participate in code reviews to ensure adherence to coding standards and quality guidelines. Stay up-to-date with industry trends and emerging technologies to continuously improve technical skills.  Requirements and Qualifications:   Bachelor's degree in Computer Science, Software Engineering, or a related field. 0-2 years of experience in software development, preferably as a Full Stack Developer.  Good understanding of Java programming language and SQL database management. Knowledge and experience in API development, including RESTful APIs. Familiarity with Spring framework and Hibernate ORM (Object-Relational Mapping) is an advantage. Experience in front-end development using Angular or Flutter is a plus. Solid understanding of software development lifecycle and agile methodologies. Excellent problem-solving and analytical skills. Strong communication and collaboration skills. Ability to work independently and as part of a team in a fast-paced environment. A passion for learning new technologies and keeping up with industry trends."
  },
  {
    "title": "c# developer",
    "company": "DolphiTek",
    "location": "Lebanon",
    "postingDate": "3 days ago",
    "applicants": "Over 100 applicants",
    "description": "About the job  Company Description  DolphiTek is a software development company based in Beirut, Lebanon. We specialize in .NET Framework for Web and Mobile App development, and we offer a full management and communication software system for schools and universities.     Role Description  This is a remote contract role for a C# .NET Developer. The C# .NET Developer will be responsible for developing and maintaining web and mobile applications using C# and the .NET Framework. They will also be involved in back-end web development, software development, and programming tasks.     Responsibilities  Translate application storyboards and use cases into functional applications Design, build, and maintain efficient, reusable, and reliable C# code Ensure the best possible performance, quality, and responsiveness of applications Identify bottlenecks and bugs, and devise solutions to these problems Help maintain code quality, organization, and automatization     Skills     Proficient in C#, with a good knowledge of its ecosystems Understanding of REST APIs, the document request model, and offline storage Strong understanding of object-oriented programming Skill for writing reusable C# libraries Knowledge of concurrency patterns in C# Familiarity with SQL Knack for writing clean, readable C# code Understanding fundamental design principles behind a scalable application Implementing automated testing platforms and unit tests Proficient understanding of code versioning tools such as GIT Familiarity with continuous integration AWS experience is a plus Focus on delivering exceptional results and meeting goals, rather than adhering to strict working hours. Communicate openly and transparently with team members and leadership. Take ownership of your work and make autonomous decisions to drive success. Bachelor degree in computer science or computer engineering Autonomous and comfortable with teleworking Languages: Arabic, English - French is a plus     What do we offer?  Teleworking and flexible working hours Competitive salary based years of experience     Start date ASAP  please email your CVs to contact@dolphitek.net"
  },
  {
    "title": "Mobile Developer Android",
    "company": "White Peaks Solutions",
    "location": "Beirut, Beirut Governorate, Lebanon",
    "postingDate": "No Posting Date Found",
    "applicants": "29 applicants",
    "description": "About the job  Job Description  The Mobile Developer-Android is responsible for maintaining, modifying, and creating new features on existing and new projects.   The Mobile Developer-Android will be working as a part of a multidisciplinary team including front-end and other back-end developers to fulfill the tasks and projects assigned to them.        Basic Functions      Collaborate with management, departments, and customers to identify end-user requirements and specifications Design algorithms and flowcharts to create new mobile apps Produce efficient and elegant code based on requirements Work closely with other developers, UX designers, business, and systems analysts Test and deploy mobile apps Troubleshoot, debug, maintain, and improve existing apps Compile and assess user feedback to improve software performance Observe user feedback to recommend improvements to existing software products Develop technical documentation to guide future software development projects     Security Related Role     Secure Coding Practices: Follow secure coding practices to minimize vulnerabilities in the code. Stay updated on common security vulnerabilities and mitigation techniques. (Refer to SDLC). Code Reviews: Actively participate in code reviews with a focus on security aspects. Provide constructive feedback to team members on secure coding practices. Security Testing: Conduct and automate security testing, including static code analysis, dynamic analysis, and penetration testing. Identify and remediate security vulnerabilities during the development phase. Security Requirements: Work with stakeholders to understand and implement security requirements. Integrate security considerations into user stories and development tasks. Secure Architecture Design: Contribute to the design of secure software architectures. Implement security controls at the application and infrastructure levels.  API Security: Ensure the security of APIs by implementing authentication, authorization, and encryption mechanisms. Validate input and output to prevent common API security issues. Dependency Scanning: Regularly scan and update third-party dependencies for known vulnerabilities. Monitor and patch dependencies to address security vulnerabilities. Security Education: Stay informed about the latest security trends, threats, and best practices. Share security knowledge with team members through training sessions and workshops. Incident Response: Be part of the incident response team to investigate and address security incidents. Collaborate with other teams to implement corrective actions. Authentication and Authorization: Implement secure authentication and authorization mechanisms. Ensure that only authorized users have access to sensitive features and data. Secure Configuration Management: Implement and maintain secure configuration management practices. Regularly review and update configurations to align with security best practices. Collaboration with DevOps and IT Teams: Work closely with DevOps and IT teams to integrate security into the CI/CD pipeline. Implement security controls for containerization and orchestration platforms. Security Documentation: Document security-related decisions, configurations, and processes. Maintain a knowledge base for secure coding practices and security-related guidelines. Continuous Learning: Continuously improve security knowledge and skills through training and certifications. Participate in community forums and conferences focused on secure development practices. Security Champions Program: Act as a security advocate and, if applicable, participate in or lead a security champions program within the development team.     Deliverables     Design new mobile apps based on requirements Create and apply new features on existing apps following the needs Continuously test and troubleshoot the software performance to ensure the proper functionality     Additional Duties and Responsibilities     Stay up to date with new framework releases and updates Ensure fast turnaround of customer requests Report appropriately and transparently on the reporting platforms provided by the Department.  Communicate and reciprocate team efforts and collaborate with team members accordingly to ensure high quality service.  Escalate upselling opportunities to the seniors and Department manager  Explore and learn new technologies that are relevant to the company’s goals Suggest improvements to existing features     Reporting Standards     Basic degree of freedom in performing job duties and responsibilities based on adopted process within the Company Requirement to request approval of authorized personnel when new solutions/processes are required Requirement to report all customer feedback and escalate critical issues to line manager and authorized personnel Requirement to liaise and coordinate with other departments as needed     Knowledge, Skills and Abilities Required     To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.     · Extensive experience in mobile app development along with their API usage  · 5+ years’ experience in Kotlin / Java  · Experience with Android SDK  · Experience with native app development standards  · Experience in notification management  · Experience working with remote data via REST and JSON  · Experience with third-party libraries and APIs  · Knowledge in Android TV development  · Working knowledge of the general mobile landscape, architectures, trends, and emerging technologies  · Solid understanding of the full mobile development life cycle.  · Highly experienced in GIT  · Understanding of design patterns  · Experience in CI/CD methodologies  · Enthusiastic about research and new technologies  · Experience with Agile and Scrum development methodologies  · Ability to learn quickly and work independently or as part of a team  · Ability to understand and implement business requirements into a functioning product  · Problem Solving  · Ability to understand Business Requirements  · Interpersonal Skills     Core Competencies:     Across the Board:  · Working with People  · Adhering to Principles and Values  · Learning and Researching  · Following Instructions and Procedures  · Coping with Pressures and Setbacks  · Achieving Personal Work Goals and Objectives     Job Specific Competencies:     · Writing and Reporting  · Applying Expertise and Technology  · Analyzing  · Creating and Innovating  · Delivering Results and Meeting Customer Expectations  · Adapting and Responding to Change     Physical Demands     To perform this job as needed, no additional physical demands are required.     Working Conditions     This job is mainly performed from the Company offices with possible rare customer visits and / or external meetings.     Performance Standards      The Mobile Developer-Android is evaluated based on:  Alignment with Company vision, mission, and values Compliance to Company rules, regulations, policies, procedures, directives, standardizations, and practices Performance against current Job Description, Deliverables, and KPIs set out for this position Exhibition of KSAs and core competencies required for this job     Education, Vocational and Experience Requirements and Preferences     BA/BS degree (required) Major in computer science or equivalent 4-6 years of app development experience (required)     Disclaimer     The above listed functions and responsibilities are intended to describe the general nature and level of work being performed by this capacity. They are not to be construed as an exhaustive list of responsibilities, duties and skills required. All job descriptions may change based on business needs and personnel may be required to perform different and/or additional duties as needed, all within the general framework of their jobs."
  },
  {
    "title": "Full Stack Developer",
    "company": "Khatib & Alami",
    "location": "Beirut Governorate, Lebanon",
    "postingDate": "1 week ago",
    "applicants": "99 applicants",
    "description": "About the job  In this dynamic role, you will play a key role in shaping and guiding our application development initiatives, contributing to the growth and success of our team. Your expertise will be instrumental in steering projects, fostering innovation, and ensuring the delivery of high-quality solutions.     Join us at the forefront of digital excellence – apply now and be a driving force in transforming the landscape of technology!     The job holder will be leading the following;  Designing, developing, and modifying modules based on functional and system requirements designs Contributes to the verification of the Business Requirements documents, and the development of Database, Application Design, and installation documentation Receives programming tasks related to complex application functionality from a Requirements Specification document, then develops the code and translates the logic into a programming language Reviews code written by others, combines all the fragmented code together, and tests the complete functionality Monitor progress towards project deliverables under their jurisdiction together with the Project Manager and take all necessary steps to ensure on-time delivery Working closely with the Development Team and the Project Manager to understand the functional and systems requirements Participating in the testing process through unit testing and bug fixes Participate and provide internal feedback on lessons learned through a project’s delivery Participating in internal capacity-building workshops     Qualifications, Skills, and Experience Required to Execute this Role  Bachelor’s Degree in Computer Science, Computer Engineering, or Management Information Systems 3+ years of professional experience in a software development function Solid knowledge of Python and Django Expertise in relational database systems like PostgreSQL or MySQL Experience with frontend frameworks like Vue.js and React Demonstrated skill in creating pixel-perfect and responsive interfaces using (S)CSS Experience with tools like Docker, GIT, Webpack, SCSS, NGINX, pytest, Redis, Celery, and ESLint Good communication and presentation skills Good interpersonal skills Proficiency in spoken and written English and Arabic"
  },
  {
    "title": "DevOps Engineer",
    "company": "Liaison",
    "location": "Beirut Governorate, Lebanon",
    "postingDate": "2 weeks ago",
    "applicants": "46 applicants",
    "description": "About the job  At Liaison, we’ve helped higher education institutions build better, more diverse classes for three decades. You may recognize us as the company behind the Centralized Application Service (CAS), Enrollment Marketing services and platform (EMP), SlideRoom, Time2Track, TargetX (CRM) and Othot.     Everything we do is focused on taking that proven success and expanding its scope and scale. Over 31,000 programs on more than 1,000 campuses see us as a forward-thinking partner integral to meeting their total enrollment goals — and we’re building the data- and mission-driven team that will reinforce our role for decades to come.     We are seeking a capable, motivated, and flexible IT resource to join our DevOps team. If you love tackling problems head-on, enjoy coming up with creative solutions for complex problems and like keeping yourself updated with the latest trends in technology, then you will fit in well with our team. We run a fast-paced but casual team that operate in a supportive atmosphere.     Responsibilities:  Manage and prioritize day to day workloads and support requests Architect, design and deploy logging, metrics and alerting tool chains Keep systems patched and up to date Leads the collaboration with development teams to discuss, analyze or resolve application issues or to assist with engineering projects Contribute to planning efforts for disaster recovery, capacity expansion, component upgrading and system hardening Work with engineering teams to increase the operational stability of the platform Train and mentor more junior personnel Monitor, analyze and troubleshoot problems within DevOps tool chains and infrastructure Increase automation and environment agnostic infrastructure while keeping an eye on new tools and techniques when possible Key contributor in a DevOps-oriented, cloud-focused systems and infrastructure engineering organization Play a strategic role in the design and build of state-of-the-art application/infrastructure systems with the high emphasis on security Manage service delivery, systems reliability and scalability of a multi-tenant platform in a SaaS based environment Build, configure, and maintain the frameworks, tools, and systems that enable optimal performance of the business applications Create, maintain and update system documentation     Required Skills:  Bachelor’s Degree or equivalent combination of education and experience 7+ years of experience working in a Linux/Unix environment 2+ years of experience with Kubernetes and Containers 3+ years of Management experience in DevOps, Release Engineering or Software Engineering 5+ years of experience in a DevOps capacity 5+ years of experience in designing, deploying and maintaining highly available applications in the cloud (preferably AWS) 3+ years’ experience using source control systems such as Git 3+ years’ experience using/working with continuous integration systems like Jenkins. Strong comprehension, problem-solving & troubleshooting, analytical and consultative skills Ability to build positive working relationships with the business contacts, within our IT team, and other IT departments and partners Working knowledge of Golden signals, USE and RED methods application Leadership and project management experience with strong understanding of tools and automation frameworks Demonstrated experience working in agile environments Experience in systems automation, virtualization, orchestration, continuous integration, deployment, and implementation. Experience in scaling distributed data systems, deploying and managing software in production environment and container-based service deployment and ability to use various open-source technologies. Skills in infrastructure automation tools – CloudFormation and/or CDK is a plus Excellent verbal and written communication and interpersonal skills Experience with the Atlassian Tools such as JIRA/Confluence Demonstrated ability to quickly grasp new technologies Must be action oriented, capable of multitasking well based on priorities Strong team player who enjoys working in a fast-paced, dynamic environment Experience with Agile/Scrum methodologies Ability to work under pressure, multiple deadlines and minimal supervision"
  }
]